{
    "0": {
        "text": "Raus hier!\nLiebe Leser*innen\n\nDas ist ein kurzes, digitales Spielbuch.\n\nZum Spielen wird ein A4-Blatt (4mm kariert) und Schreibzeug benötigt. Das Buch spricht die Spieler*innen mit \"du\" an.\n\nSpielbücher in gedruckter Form waren in den 1980er-Jahren populär. Sie erlaubten es, interaktive Geschichten zu erzählen: nach jedem Abschnitt konnten die Leser*innen eine Entscheidung treffen; je nach Entscheidung ging die Geschichte dann bei einem anderen Abschnitt weiter.\n\nComputerspiele wurden nach der gleichen Idee entwickelt: die Spieler*innen konnten nach einem Abschnitt der Geschichte eine Entscheidung treffen und der Computer zeigte daraufhin die passende Fortsetzung der Geschichte an.\n\nDas vorliegende Spielbuch wurde extra für den Informatikunterricht ander Kantonsschule Reussbühl entwickelt und wird im Rahmen des Praktikums im obligatorischen Fach Informatik als Computerspiel programmiert.\n\nViel Spass!\nTimy Liniger \n",
        "input": false,
        "code": false,
        "next": 1
    },
    "1": {
        "text": "Es ist stockdunkel und riecht nach Keller. In der Stille ist das leise Rauschen einer Lüftungsanlage zu hören.\n\nDeine Ausrüstung umfasst eine LED-Taschenlampe, einen Kompass und eine Trinkflasche, die sich noch recht voll anfühlt. Ob der Strom oder das Wasser zuerst ausgeht, wird sich zeigen. Am besten ist, du findest schnell einen Weg raus hier!\n\nEin Schluck Wasser hilft ein wenig gegen den Geschmack von Staub auf der Zunge. Dann schaltest du die Taschenlampe ein und blickst dich um: Du befindest dich in einem quadratischen Raum aus billigen Betonelementen. Vor dir auf dem kahlen Betonboden steht ein Stahlkoffer, an dem ein gelber Zettel klebt. In einer Ecke liegen ein Blatt Papier und ein Bleistift.\nWillst du: \n\n1: Zuerst zum Blatt Papier gehen?\n2: Zuerstden Koffer untersuchen? \n",
        "input": 2,
        "code": false,
        "next": null,
        "ifs": {
            "if_1": 11,
            "if_2": 22
        }
    },
    "11": {
        "text": "Das Blatt ist im Format A4 (4 mm kariert). Es ist leer.\nDu packst Papier und Bleistift ein, vielleicht sind sie ja noch nützlich. Dann wendest du dich dem Koffer zu.\n",
        "input": false,
        "code": false,
        "next": 12
    },
    "12": {
        "text": "Der Stahlkoffer ist mit einem dreistelligen Zahlenschloss gesichert. Auf dem gelben Zettel steht:\n\nErkunde den Keller, um den Code zum Koffer zu finden; dann kannst du den Weg in die Freiheit öffnen. Zeichne eine genaue Karte des Kellers, sie wird entscheidend sein für deinen Erfolg!\n\nDie Karte passt im Massstab 1 Häuschen pro Meter gut auf ein A4-Blatt (4 mm kariert), wenn du das Blatt im Hochformat verwendest und deinen Startraum am unteren Blattrand in der Mitte einzeichnest.\"\n\nDu betrachtest den Raum noch einmal genau. Laut deinem Kompass verlaufen die Wände genau in Nord-Süd-Richtung bzw. Ost-West-Richtung. Sie sind aus Fertigbauelementen zusammengefügt. Sie sind zwar sehr schmal, aber wirken extrem solide. Der Raum, in dem du dich befindest istexakt vier mal vier Meter gross. In der Mitte der Nordwand befindet sich eine Tür, in die auf Kopfhöhe eine Glasscheibe eingesetzt ist.\n\nDu zeichnest den Raum auf dein Blatt Papier. Dann öffnest du die Tür und verlässt den Raum. \n",
        "input": false,
        "code": false,
        "next": 31
    },
    "31": {
        "text": "Du befindest dich in einem Korridor, der von West nach Ost verläuft. Er hat eine Länge von 20 Meter und ist 4 Meter breit.\n\nIm Süden gibt es westlich von der Tür, durch die du gekommen bist, eine weitere Tür und östlich drei weitere Türen. Sie sind alle verschlossen, aber du kannst durch die Glasscheiben hineinblicken. Du erkennst, dass hinter jeder Tür ein Raum liegt, der identisch mit deinem Startraum ist. Die Ostwand des östlichsten Raums ist die gleiche Wand wie die Ostwand des Korridors. Auch die Westwand des westlichsten Raums und die Westwand des Korridors sind identisch.\n\nIm Norden gibt es genau gegenüber der Tür zu deinem Startraum und westlich davon je einen weiteren identischen Räum. Auch diese haben je eine Türe in der Wandmitte mit einer lasscheibe - leider sind auch sie verschlossen.\n\nIn der Mitte der Nordwand hat der Korridor eine weitere Tür, die nicht verschlossen ist. Also gehst du da weiter.G\n",
        "input": false,
        "code": false,
        "next": 32
    },
    "32": {
        "text": "Du hast einen weiteren Korridor erreicht. Dieser verläuft von Süden nach Norden und ist ebenfalls 20 Meter lang und 4 Meter breit. Du betrittst den Korridor durch die einzige Tür in der Südwand.\n\nSofort fällt dein Blick auf das Schild, das genau in der Mitte der Ostwand angebracht ist. Ausgang, steht da. Du eilst hin, musst aber leider feststellen, dass die schwere Stahltür, die ins Panzerglas eingelassen ist, verschlossen ist.\n\nDurch das dicke Panzerglas kannst du hinter der Stahltür ein Treppenhaus erkennen: Es ist quadratisch (4 Meter auf 4 Meter, das Ausgang Schild befindet sich genau in der Mitte der 4 Meter Panzerglaswand, die das Treppenhaus vom Korridor trennen). Die Treppe führt nach oben, beginnt in Richtung Osten der Südwand des Treppenauses entlang und ist 2 Meter breit. Nach 2 Meter in Richtung Osten gibt es einen 2 Meter breiten Zwischenboden, der die östliche Hälfte des Treppenhauses ausfüllt. Von diesem Zwischenboden aus geht die Treppe dann der Nordwand des Treppenhauses entlang weiter nach oben, diesmal in westliche Richtung.\n\nDu entdeckst im Korridor noch zwei weitere Türen, die in dir unbekannte Räume führen: eine führt 4 Meter vom südlichen Ende des Korridors entfernt nach Osten, die andere führt 4 Meter vom nördlichen Ende des Korridors entfernt nach Westen.\nWillst du: \n1: Zuerst nach Osten gehen?\n2: Zuerst nach Westen gehen?\n\n",
        "input": 2,
        "code": false,
        "next": null,
        "ifs": {
            "if_1": 101,
            "if_2": 201
        }
    },
    "101": {
        "text": "Du öffnest die Tür in Richtung Osten und erreichst einen Raum, der 8 Meter auf 8 Meter misst. Die Tür, durch die du gekommen bist, befindet sich in der Westwand, 4 Meter von der Südwand entfernt. Es scheint sich um ein Büro gehandelt zu haben, aber du findest nur noch ein paar leere Tische.\n\n2 Meter von der Ostwand entfernt gibt es eine Tür in der Nordwand. Du gehst dort weiter.\n",
        "input": false,
        "code": false,
        "next": 102
    },
    "102": {
        "text": "Du erreichst einen rechteckigen Raum, der sich 8 Meter nach Norden erstreckt und 4 Meter breit ist. Die Ostwand dieses Raumes ist die Fortsetzung der Ostwand im Raum zuvor.\n\nHier ist das Geräusch der Lüftung recht laut und du entdeckst in der Mitte der Ostwand einen Lüftungsschacht. Neugierig leuchtest du den Lüftungsschacht aus. Hinter dem Gitter erkennst du eine Nachricht auf einem gelben Zettel, der auf der Innenseite des Lüftungsschachts festgeklebt ist. Vom Blickwinkel her kannst du die Nachricht nicht lesen und das Gitter kannst du ohne Schraubenzieher auch nicht entfernen.\n\nAm Nordende des Raums gibt es eine Tür, die weiter nach Norden führt. Du entscheidest dich, den Keller einmal in diese Richtung weiter zu erkunden.\n",
        "input": false,
        "code": false,
        "next": 103
    },
    "103": {
        "text": "Dieser Raum erstreckt sich 8 Meter nach Westen und 4 Meter nach Norden. Die Ostwand ist identisch mit der Ostwand des vorherigen Raums.\n\nHier gibt es nichts zu sehen ausser den zwei Türen in der Südwand: Du hast den Raum durch die Tür betreten, die 2 Meter von der Ostwand entfernt ist. Deshalb gehst du durch die Tür weiter, die 2 Meter von der Westwand entfernt ist.\n",
        "input": false,
        "code": false,
        "next": 104
    },
    "104": {
        "text": "Dieser Raum misst 4 Meter auf 4 Meter und ist eine Sackgasse: es gibt nur die eine Tür in der Nordwand, durch die du den Raum betreten hast.\n\nAn der Südwand hängt ein gelber Zettel. Er ist mit einem Taschenmesser befestigt, das mit der Klinge in die Ritze zwischen den zwei westlichsten Wandelementen der Südwand geklemmt wurde.\n\nDu packst das Taschenmesser ein. Es verfügt über einen Schraubenzieher!\n\nDann wendest du dich der Notiz zu:\n\n\"Der Code zum Tresor ergibt sich aus der Zahl der Füsse im Rätsel der Sphinx, in der Reihenfolge, wie sie im Rätsel vorkommen.\"\n\nDa du dich gut mit der griechischen Mythologie auskennst, weisst du natürlich sofort, was der Code ist. Den erwähnten Tresor hast du im Keller allerdings noch nicht gesehen.\nWillst du: \n1: Zuerstden Tresor suchen?\n2: Zuerst mit deinem neuen Schraubenzieher die Notiz aus dem Lüftungsschacht holen? \n",
        "input": 2,
        "code": false,
        "next": null,
        "ifs": {
            "if_1": 111,
            "if_2": 161
        }
    },
    "111": {
        "text": "Du gehst zurück in den Korridor, der von Süden nach Norden verläuft und da durch die Tür, die vier Meter vom nördlichen Ende des Korridors entfernt nach Westen führt.\n\nDu erreichst einen Raum, der 8 Meter auf 8 Meter misst. Es scheint sich um ein Büro gehandelt zu haben, aber du findest hier nur noch einen Tisch mit einer verstaubten Underwood-Schreibmaschine. Schön, aber nicht hilfreich.\n\nDie Tür, durch die du gekommen bist, befindet sich in der Ostwand, vier Meter von der Nordwand entfernt. Du gehst durch die andere Tür, die sich in der Mitte der Südwand befindet.\n",
        "input": false,
        "code": true,
        "next": 113,
        "is_code": "423"
    },
    "113": {
        "text": "Du stellst den Code ein und versuchst, die Tresortür zu öffnen. Lautlos schwingt sie auf und ein gelber Zettel flattert aus dem Tresor. Abgesehen davon ist der Tresor leer.\n\nDu hebst den Zettel auf und liest:\n\n\"The answer to life, the universe and everything.\nAusserdem der Code, mit dem du diesen Tresor geöffnet hast.\"\n\nDu bist nicht so sicher, was du damit anfangen sollst. Deshalb entscheidest du dich, noch die Notiz im Lüftungsschacht zu holen.\n",
        "input": false,
        "code": false,
        "next": 114
    },
    "161": {
        "text": "Du gehst zurück in den Raum mit dem Lüftungsschacht und schraubst das Gitter vor dem Lüftungsschacht weg. Er ist viel zu klein, um als Ausweg aus dem Keller in Frage zu kommen. Aber vielleicht beinhaltet die Notiz auf dem gelben Zettel ja einen nützlichen Hinweis:\n\n\"Um den Code für den Koffer zu finden, zähle unter allen Zahlen, die auf der Notiz im Tresor genannt werden:\n\n1. Wie oft die Ziffer 4 vorkommt.\n2. Wie oft die Ziffer 7 vorkommt.\n3. Wie oft die Ziffer 3 vorkommt.\"\n\nEs ist definitiv an der Zeit, diesen Tresor zu suchen! Du gehst zurück in den Korridor, der von Süden nach Norden verläuft und da durch die Tür, die vier Meter vom nördlichen Ende des Korridors entfernt nach Westen führt.\n",
        "input": false,
        "code": false,
        "next": 162
    },
    "162": {
        "text": "Du erreichst einen Raum, der 8 Meter auf 8 Meter misst. Es scheint sich um ein Büro gehandelt zu haben, aber du findest hier nur noch einen Tisch mit einer verstaubten Underwood-Schreibmaschine. Schön, aber nicht hilfreich.\n\nDie Tür, durch die du gekommen bist, befindet sich in der Ostwand, vier Meter von der Nordwand entfernt. Du gehst durch die andere Tür, die sich in der Mitte der Südwand befindet.\n",
        "input": false,
        "code": false,
        "next": 163
    },
    "114": {
        "text": "Du gehst zurück in den Raum mit dem Lüftungsschacht und schraubst das Gitter vor dem Lüftungsschacht weg. Er ist viel zu klein, um als Ausweg aus dem Keller in Frage zu kommen. Aber vielleicht beinhaltet die Notiz auf dem gelben Zettel ja einen nützlichen Hinweis:\n\n\"Um den Code für den Koffer zu finden, zähle unter allen Zahlen, die auf der Notiz im Tresor genannt werden:\n\n1. Wie oft die Ziffer 4 vorkommt.\n2. Wie oft die Ziffer 7 vorkommt.  3. Wie oft die Ziffer 3 vorkommt.\"\n\nDu nimmst die Notiz aus dem Tresor hervor:\n\n\"The answer to life, the universe and everything.\nAusserdem der Code, mit dem du diesen Tresor geöffnet hast.\"\n\nEasy, die erste genannte Zahl kennst du, weil du viel gelesen hast; und den Tresor hast du mit",
        "input": false,
        "code": true,
        "next": 301,
        "is_code": "201"
    },
    "301": {
        "text": "Du stellst den Code ein und versuchst, den Stahlkoffer zu öffnen. Es gelingt!\r\n\r\nIm Koffer liegt etwas, was wie ein aufgewickeltes Stück einer Schnur aus Plastik aussieht, mit einer Art Stoppuhr am Ende. Darunter liegt ein gelber Zettel mit einer Erklärung:\r\n\r\n\"Diese Sprengschnur kann verwendet werden, um ein Loch in eines der Betonwandelemente zu sprengen. Sie haftet selbständig an der Wand, du musst sie nur an der gewünschten Stelle in Form eines geschlossenen Kreises anbringen.\r\n\r\nZünden kannst du die Sprengschnur, indem du einen Countdown auf der Uhr einstellst. Wähle ausreichend Zeit, damit du in einem Nachbarraum in Deckung gehen kannst, halte die Ohren zu und den Mund offen!\r\n\r\nWarnung: Die Sprengkraft dieser Sprengschnur reicht nur für die Betonwandelemente aus. Die Stahltür und das Panzerglas, die das Treppenhaus zum Korridor hin begrenzen, sind zu stabil für diese kleine Menge Sprengstoff!\"\r\n\r\nDu gehst zurück in den Korridor, um noch einmal das Treppenhaus zu betrachten.",
        "input": false,
        "code": false,
        "next": 302
    },
    "302": {
        "text": "Exakt in der Mitte der Ostwand im Korridor, der von Süden nach Norden verläuft, hängt das Ausgang Schild an der Wand. Je 2 Meter in nördliche und südliche Richtung besteht die Ostwand aus Panzerglas statt der üblichen Betonelemente. Im Panzerglas eingelassen ist die massive Stahltür.\n\nDas Treppenhaus ist quadratisch (4 Meter auf 4 Meter, das Ausgang Schild befindet sich genau in der Mitte der 4 Meter Panzerglaswand, die das Treppenhaus vom Korridor trennen). Die Treppe führt nach oben, beginnt in Richtung Osten der Südwand des Treppenhauses entlang und ist 2 Meterbreit. Nach 2 Meter in Richtung Osten gibt es einen 2 Meter breiten Zwischenboden, der die östliche Hälfte des Treppenhauses ausfüllt. Von diesem Zwischenboden aus geht die Treppe dann der Nordwand des Treppenhauses entlang weiter nach oben, diesmal in westliche Richtung.\n\nWegen dem Zwischenboden scheint die östliche Hälfte des Treppenhauses bis auf eine Höhe von mindestens 1.5 Meter vollständig mit Beton gefüllt zu sein. Auch die Unterseite der Treppe der Südwand entlang scheint mit Beton aufgefüllt zu sein. In der westlichen Hälfte des Treppenhauses bestehen die Nord- und Südwand scheinbar aus den üblichen Betonelementen.\n\nDu überlegst, welche Wand du sprengen sollst. Zeit, diesen Keller zu verlassen!\nIn welchem Raum befindet sich die Wand, die du sprengen willst? \n1. Im Startraum.\n2. Im West-Ost-Korridor.\n3. Im Süd-Nord-Korridor.\n4.Im Büro mit den leeren Tischen.\n5. Im Büro mit der Schreibmaschine.\n6. Im Büro mit dem Tresor.\n7. Im Raum mit dem Lüftungsschacht.\n8. Im Raum, der 2 Türen in Richtung Süden hat.\n:. Im Raum, in dem das Taschenmesser steckte.\n",
        "input": 9,
        "code": false,
        "next": null,
        "ifs": {
            "if_1": 311,
            "if_2": 311,
            "if_3": 311,
            "if_4": 311,
            "if_5": 311,
            "if_6": 311,
            "if_7": 311,
            "if_8": 311,
            "if_9": 321
        }
    },
    "311": {
        "text": "In welcher Wand befindet sich das Wandelement, in das du das Loch sprengen willst?\r\n\r\n1. Nordwand\r\n2. Ostwand\r\n3. Südwand\r\n4. Westwand",
        "input": 4,
        "code": false,
        "next": null,
        "ifs": {
            "if_1": 312,
            "if_2": 312,
            "if_3": 312,
            "if_4": 312
        }
    },
    "312": {
        "text": "Wandelemente sind 1 Meter breit. Gib die Nummer des Wandelements an (vom linken Rand der ausgewählten Wand gezählt), in das du das Loch sprengen willst.",
        "input": 4,
        "code": true,
        "next": 313,
        "is_code": "*"
    },
    "313": {
        "text": "Du gehst in den entsprechenden Raum und bringst die Sprengschnur auf dem ausgewählten Wandelement an. Du stellst die Stoppuhr auf 60 Sekunden, gehst gemütlich in den Nachbarraum, hältst die Ohren zu und den Mund offen und wartest. \r\n\r\nPlötzlich hörst du einen dumpfen Knall und die Luft füllt sich mit Staub. Du hustest kurz und wartest ein wenig, damit sich der Staub legt und du im Schein deiner Taschenlampe das Resultat begutachten kannst.\r\n\r\nNein, leider kein Erfolg. Vielleicht bist du beim nächsten Versuch erfolgreich!",
        "input": false,
        "code": false,
        "next": null
    },
    "322": {
        "text": "Wandelemente sind 1 Meter breit. Gib die Nummer des Wandelements an (vom linken Rand der ausgewählten Wand gezählt), in das du das Loch sprengen willst.",
        "input": false,
        "code": true,
        "next": 323,
        "is_code": "*"
    },
    "331": {
        "text": "331",
        "input": 4,
        "code": false,
        "next": null,
        "ifs": {
            "if_1": 333,
            "if_2": 333,
            "if_3": 332,
            "if_4": 332
        }
    },
    "332": {
        "text": "Du gehst in den entsprechenden Raum und bringst die Sprengschnur auf dem ausgewählten Wandelement an. Du stellst die Stoppuhr auf 60 Sekunden, gehst gemütlich in den Nachbarraum, hältst die Ohren zu und den Mund offen und wartest. \r\n\r\nPlötzlich hörst du einen dumpfen Knall und die Luft füllt sich mit Staub. Du hustest kurz und wartest ein wenig, damit sich der Staub legt und du im Schein deiner Taschenlampe das Resultat begutachten kannst.\r\n\r\nNein, knapp daneben. Du siehst den Betonsockel des Zwischenbodens aus dem Treppenhaus durch dein frisch gesprengtes Loch. Vielleicht bist du beim nächsten Versuch erfolgreich!",
        "input": false,
        "code": false,
        "next": null
    },
    "323": {
        "text": "Du gehst in den entsprechenden Raum und bringst die Sprengschnur auf dem ausgewählten Wandelement an. Du stellst die Stoppuhr auf 60 Sekunden, gehst gemütlich in den Nachbarraum, hältst die Ohren zu und den Mund offen und wartest. \r\n\r\nPlötzlich hörst du einen dumpfen Knall und die Luft füllt sich mit Staub. Du hustest kurz und wartest ein wenig, damit sich der Staub legt und du im Schein deiner Taschenlampe das Resultat begutachten kannst.\r\n\r\nNein, leider kein Erfolg. Vielleicht bist du beim nächsten Versuch erfolgreich!",
        "input": false,
        "code": false,
        "next": null
    },
    "333": {
        "text": "Du gehst in den entsprechenden Raum und bringst die Sprengschnur auf dem ausgewählten Wandelement an. Du stellst die Stoppuhr auf 60 Sekunden, gehst gemütlich in den Nachbarraum, hältst die Ohren zu und den Mund offen und wartest. \r\n\r\nPlötzlich hörst du einen dumpfen Knall und die Luft füllt sich mit Staub. Du hustest kurz und wartest ein wenig, damit sich der Staub legt und du im Schein deiner Taschenlampe das Resultat begutachten kannst.\r\n\r\nSehr gut, das war Präzisionsarbeit! Ein rundes Loch, gerade gross genug, damit du durchkriechen kannst, führt ins Treppenhaus. Du kriechst durch und steigst die Treppe hoch.\r\n\r\nRaus hier!",
        "input": false,
        "code": false,
        "next": null
    },
    "163": {
        "text": "Du erreichst ein weiteres Büro. Dieser Raum misst 8 Meter auf 8 Meter. Es gibt einen riesigen Schreibtisch, auf dem ein schwerer Tresor steht. Zur Sicherheit nimmst du die Notiz, die mit dem Taschenmesser an der Wand befestigt war, noch einmal zur Hand:\r\n\r\n\"Der Code zum Tresor ergibt sich aus der Zahl der Füsse im Rätsel der Sphinx, in der Reihenfolge, wie sie im Rätsel vorkommen.\\",
        "input": false,
        "code": true,
        "next": 164,
        "is_code": "423"
    },
    "164": {
        "text": "Du stellst den Code ein und versuchst, die Tresortür zu öffnen. Lautlos schwingt sie auf und ein gelber Zettel flattert aus dem Tresor. Abgesehen davon ist der Tresor leer.\r\n\r\nDu hebst den Zettel auf und liest:\r\n\r\n\"The answer to life, the universe and everything.\r\nAusserdem der Code, mit dem du diesen Tresor geöffnet hast.\"\r\n\r\nDu nimmst noch einmal die Notiz hervor, die du im Lüftungsschacht gefunden hast:\r\n\r\n\"Um den Code für den Koffer zu finden, zähle unter allen Zahlen, die auf der Notiz im Tresor genannt werden:\r\n\r\n1. Wie oft die Ziffer 4 vorkommt.\r\n2. Wie oft die Ziffer 7 vorkommt.\r\n3. Wie oft die Ziffer 3 vorkommt.\"\r\n\r\nEasy, die erste genannte Zahl kennst du, weil du viel gelesen hast und den Tresor hast du ja gerade eben mit dem Code 423 geöffnet.\r\nGib deinen Code für den Stahlkoffer ein: *",
        "input": false,
        "code": true,
        "next": 301,
        "is_code": "201"
    },
    "201": {
        "text": "Du öffnest die Tür in Richtung Westen und erreichst einen Raum, der 8 Meter auf 8 Meter misst. Es scheint sich um ein Büro gehandelt zu haben, aber du findest hier nur noch einen Tisch mit einer verstaubten Underwood-Schreibmaschine. Schön, aber nicht hilfreich.\r\n\r\nDie Tür, durch die du gekommen bist, befindet sich in der Ostwand, vier Meter von der Nordwand entfernt. Du gehst durch die andere Tür, die sich in der Mitte der Südwand befindet.",
        "input": false,
        "code": false,
        "next": 202
    },
    "202": {
        "text": "Du erreichst ein weiteres Büro. Dieser Raum misst 8 Meter auf 8 Meter. Es gibt einen riesigen Schreibtisch, auf dem ein schwerer Tresor steht. Leider hast du keine Ahnung, was der Code ist.\r\n\r\nDu entscheidest, zurück in den Süd-Nord-Korridor zu gehen und dort durch die Tür zu gehen, die 4 Meter entfernt vom südlichen Ende des Korridors nach Osten führt. Vielleicht findest du dort einen Hinweis auf den Code für den Tresor.",
        "input": false,
        "code": false,
        "next": 203
    },
    "203": {
        "text": "Du öffnest im Süd-Nord-Korridor die Tür in Richtung Osten und erreichst einen Raum, der 8 Meter auf 8 Meter misst.\r\n\r\nDie Tür, durch die du gekommen bist, befindet sich in der Westwand, 4 Meter von der Südwand entfernt. Es scheint sich um ein Büro gehandelt zu haben, aber du findest nur noch ein paar leere Tische.\r\n\r\n2 Meter von der Ostwand entfernt gibt es eine Tür in der Nordwand. Du gehst dort weiter.",
        "input": false,
        "code": false,
        "next": 204
    },
    "204": {
        "text": "Du erreichst einen rechteckigen Raum, der sich 8 Meter nach Norden erstreckt und 4 Meter breit ist. Die Ostwand dieses Raumes ist die Fortsetzung der Ostwand im Raum zuvor.\r\n\r\nHier ist das Geräusch der Lüftung recht laut und du entdeckst in der Mitte der Ostwand einen Lüftungsschacht. Neugierig leuchtest du den Lüftungsschacht aus. Hinter dem Gitter erkennst du eine Nachricht auf einem gelben Zettel, der auf der Innenseite des Lüftungsschachts festgeklebt ist. Vom Blickwinkel her kannst du die Nachricht nicht lesen und das Gitter kannst du ohne Schraubenzieher auch nicht entfernen.\r\n\r\nAm Nordende des Raums gibt es eine Tür, die weiter nach Norden führt. Das ist die einzige Tür, die du noch nicht versucht hast, also gehst du da weiter.",
        "input": false,
        "code": false,
        "next": 205
    },
    "205": {
        "text": "Dieser Raum erstreckt sich 8 Meter nach Westen und 4 Meter nach Norden. Die Ostwand ist identisch mit der Ostwand des vorherigen Raums.\r\n\r\nHier gibt es nichts zu sehen ausser den zwei Türen in der Südwand: Du hast den Raum durch die Tür betreten, die 2 Meter von der Ostwand entfernt ist. Deshalb gehst du durch die Tür weiter, die 2 Meter von der Westwand entfernt ist.",
        "input": false,
        "code": false,
        "next": 206
    },
    "206": {
        "text": "Dieser Raum misst 4 Meter auf 4 Meter und ist eine Sackgasse: es gibt nur die eine Tür in der Nordwand, durch die du den Raum betreten hast.\r\n\r\nAn der Südwand hängt ein gelber Zettel. Er ist mit einem Taschenmesser befestigt, das mit der Klinge in die Ritze zwischen den zwei westlichsten Wandelementen der Südwand geklemmt wurde.\r\n\r\nDu packst das Taschenmesser ein. Es verfügt über einen Schraubenzieher!\r\n\r\nDann wendest du dich der Notiz zu:\r\n\r\n\"Der Code zum Tresor ergibt sich aus der Zahl der Füsse im Rätsel der Sphinx, in der Reihenfolge, wie sie im Rätsel vorkommen.\"\r\n\r\nDa du dich gut mit der griechischen Mythologie auskennst, weisst du natürlich sofort, was der Code ist. Also auf zum Tresor!",
        "input": false,
        "code": false,
        "next": 207
    },
    "207": {
        "text": "Weil es auf dem Weg liegt, schraubst du noch schnell den Lüftungsschacht mit dem frisch gefundenen Schraubenzieher aus dem Taschenmesser auf. Er ist viel zu klein, um als Ausweg aus dem Keller in Frage zu kommen. Aber vielleicht beinhaltet die Notiz auf dem gelben Zettel ja einen nützlichen Hinweis:\r\n\r\n\"Um den Code für den Koffer zu finden, zähle unter allen Zahlen, die auf der Notiz im Tresor genannt werden:\r\n\r\n1. Wie oft die Ziffer 4 vorkommt.\r\n2. Wie oft die Ziffer 7 vorkommt.\r\n3. Wie oft die Ziffer 3 vorkommt.\"\r\n\r\nOK, das wird vermutlich schon verständlich sein, sobald du den Tresor geöffnet hast.",
        "input": false,
        "code": false,
        "next": 208
    },
    "208": {
        "text": "Du gehst zurück in den Raum mit dem Tresor. Dort angekommen betrachtest du den schweren Tresor. Zur Sicherheit nimmst du die Notiz, die mit dem Taschenmesser an der Wand befestigt war, noch einmal zur Hand:\r\n\r\n\"Der Code zum Tresor ergibt sich aus der Zahl der Füsse im Rätsel der Sphinx, in der Reihenfolge, wie sie im Rätsel vorkommen.\"\r\nGib deinen Code für den Tresor hier ein:",
        "input": false,
        "code": true,
        "next": 209,
        "is_code": "423"
    },
    "209": {
        "text": "Du stellst den Code ein und versuchst, die Tresort\\u00fcr zu \\u00f6ffnen. Lautlos schwingt sie auf und ein gelber Zettel flattert aus dem Tresor. Abgesehen davon ist der Tresor leer.\\r\\n\\r\\nDu hebst den Zettel auf und liest:\\r\\n\\r\\n\\\"The answer to life, the universe and everything.\\r\\nAusserdem der Code, mit dem du diesen Tresor ge\\u00f6ffnet hast.\\\"\\r\\n\\r\\nDu nimmst noch einmal die Notiz hervor, die du im L\\u00fcftungsschacht gefunden hast:\\r\\n\\r\\n\\\"Um den Code f\\u00fcr den Koffer zu finden, z\\u00e4hle unter allen Zahlen, die auf der Notiz im Tresor genannt werden:\\r\\n\\r\\n1. Wie oft die Ziffer 4 vorkommt.\\r\\n2. Wie oft die Ziffer 7 vorkommt.\\r\\n3. Wie oft die Ziffer 3 vorkommt.\\\"\\r\\n\\r\\nEasy, die erste genannte Zahl kennst du, weil du viel gelesen hast\",\" und den Tresor hast du ja gerade eben mit dem Code 423 ge\\u00f6ffnet.",
        "input": false,
        "code": true,
        "next": 301,
        "is_code": "201"
    },
    "22": {
        "text": "Du befindest dich in einem Korridor, der von West nach Ost verläuft. Er hat eine Länge von 20 Meter und ist 4 Meter breit.\r\n\r\nIm Süden gibt es westlich von der Tür, durch die du gekommen bist, eine weitere Tür und östlich drei weitere Türen. Sie sind alle verschlossen, aber du kannst durch die Glasscheiben hineinblicken. Du erkennst, dass hinter jeder Tür ein Raum liegt, der identisch mit deinem Startraum ist. Die Ostwand des östlichsten Raums ist die gleiche Wand wie die Ostwand des Korridors. Auch die Westwand des westlichsten Raums und die Westwand des Korridors sind identisch.\r\n\r\nIm Norden gibt es genau gegenüber der Tür zu deinem Startraum und westlich davon je einen weiteren identischen Räum. Auch diese haben je eine Türe in der Wandmitte mit einer Glasscheibe - leider sind auch sie verschlossen.\r\n\r\nIn der Mitte der Nordwand hat der Korridor eine weitere Tür, die nicht verschlossen ist. Also gehst du da weiter.",
        "input": false,
        "code": false,
        "next": 31
    }
}